my_gather={0,1,2,3,3,5,5,6,6,6,4,5,6,7,8,9}                 #定义集合
set_my_gather=set()                             #定义空集合
print(f"集合的内容是{my_gather},他的类型是{type(my_gather)}")           #此时从运行结果来看，重复的记录都没有了，也验证了集合不会重复这一点

#==========================================================================
my_gather.add("新添加的元素")                           #追加新元素的方法
print(f"my_gather添加新元素后为{my_gather}")
#========================================================================================

my_gather.remove(0)
print(f"my_gather删除元素后为{my_gather}")

#===================================================================
my_gather={0,1,2,3,3,5,5,6,6,6,4,5,6,7,8,9}

a=my_gather.pop()                           #随机取出一个元素给a

print(f"my_gather取出元素为{my_gather}")

my_gather.clear()                           #清空列表
print(f"my_gather清空以后为{my_gather}")
#=========================================================================================================

set1={2,4,6}
set2={2,4,9}
set3=set1.difference(set2)                  #集合1和集合2的差集（集合1有而集合2没有的）
print(set3)

set4=set1.difference_update(set2)
print(f"在集合1中，删除和集合2相同的集合{set4}")


set5=set1.union(set2)
print(f"集合1和集合2的新集合{set5}")            #集合1与集合2的新集合，包括他俩的所有元素，但原使不变


set6={1,56,54,1,2,6,1,1,5,2,21,1,5,2,21,5,6,2,23,6,6,2,21,4}
unm=len(set6)
print(f"{set6}中有{unm}个元素")                 #因为集合中没有相同元素，所以相同的只算一个


for i in set6 :                                 #对集合set6的遍历
    print(i)

