#==========================__main__===================================

def test(x,y):
    print(x+y)


if __name__=='__main__':
    test(1,1)

#   为了解决此方法，可以调用python中内置的一个main变量
#   此变量，在程序手动运行（不是调用）时，__name__变量会变成__main__变量，反之则不会
#   所以可以用if判断，结合main语句，弄成一个单行道


#=======================__all__===================================
                        #如果一个模块文件中有__all__变量，当使用from xxx impor*导入时，只能导入这个列表中的元素

__all__=['test','test1']                        
def test1(a):
    print(1)
def test2(b):
    print(2)
def test3(c):
    print(3)

