#================定义方法======================================
mylist=["myl","gmy","sahd","skdajl"]

#-----------------1.查找某元素的下标位置-----------
index=mylist.index("myl")
print(index)
#-------如果找不到会报错----ValueError: ------
# index=mylist.index("qwe")
# print(index)

 #---------------2.修改下标的值-----------------

unmlist=[1,2,3,4,5]
unmlist[0]=6        #修改正向下标
print(unmlist)

unmlist=[1,2,3,4,5]
unmlist[-4]=6       #修改反向下标
print(unmlist)

#----------------3.插入值----------------------
unmlist=[1,2,3,4,5]
unmlist.insert(2,6)    #在指定的下标位置，插入你要的元素  
print(unmlist)
#---------------4.1追加值---------------------------------------
unmlist=[1,2,3,4,5]
unmlist.append("追加到尾部")
print(unmlist)
#----------------4.2追加值-------------------------------------------
unmlist=[1,2,3,4,5]
unmlist.extend(unmlist)      #追加一批（追加一整个列表）
print(unmlist)

#-------------------5.1删除元素-------------------------------
unmlist=[1,2,3,4,5]
del unmlist[2]                  #删除下标为2的元素
print(unmlist)

#---------------------5.2删除元素------------------
unmlist=[1,2,3,4,5]
out=unmlist.pop(2)                           #删除下标为2的元素              
print(unmlist)                                #不同的是，此方法删除的元素，可以用变量类接受
print(f"用pop删除的内容为：{out}")              #输出用pop删除的内容
#---------------------5.3删除元素------------------
unmlist=[1,2,3,4,5]
unmlist.remove(2)                       #删除匹配项，删除内容为2的项
print(unmlist)                          #如果有相同的项，则删除第一个满足的项，从前往后筛选
#----------------------6.清空列表--------------------------------
unmlist=[1,2,3,4,5]
unmlist.clear()                                 #字面意思，清空列表
print(f"列表被清空了，结果是{unmlist}")
#------------------------7.1统计元素个数----------------------------

unmlist=[1,2,3,4,5]
count=unmlist.count(2)                      #统计列表中指定元素的个数
print(f"统计个数为：{count}")
#------------------------7.2统计元素总数----------------------------
unmlist=[1,2,3,4,5]
count=len(unmlist)
print(f"统计总数为：{count}")