
# =============================方法一============================================
def test(compute):
    a=compute(1,2)
    print(a)

                                        #普通的相加函数

def compute(x,y):
    return x+y

test(compute)

# ============================方法二================================================

def test(compute):
    a=compute(1,2)
    print(a)
test(lambda x ,y:x+y)                                           #使用lambda关键字来使用

# 注意事项：
    # 1.用于临时构建一个函数，只使用一次的场景
    # 2.匿名函数的定义中，函数体只能写一行代码，如果需要多行，不可用lambda，应使用def